---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ZoneFailures.ZoneNotEnclosed
source: html/4380a165-efb0-5f39-0fb9-ab9931b7ff71.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ZoneFailures.ZoneNotEnclosed Property

Zone not enclosed totally.

## Syntax (C#)
```csharp
public static FailureDefinitionId ZoneNotEnclosed { get; }
```